# HasValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..HasValue Property
IFCData Class See Also
---
Identifies if the data is empty or contains a value.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool HasValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasValue As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasValue {
	bool get ();
}
```

# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace